[
    {
        "country": "Russia",
        "city": "Moscow",
        "lat": 55.7558,
        "lon": 37.6173,
        "date": "2026-02-21 15:34:31",
        "type": "Airstrike",
        "title": "Ukrainian Air Force F-16 Captured Shooting Down Russian Target with APKWS II",
        "description": "Following the first sighting of the new capability in December 2025, a Ukrainian F-16 was captured using APKWS II laser-guided rockets to engage a drone. A Ukrainian Air Force F-16 was captured for the first time while using its Advanced Precision Kill Weapon System (APKWS) II guided rockets against a Russian unmanned system, believed to []",
        "fatalities": "0",
        "link": "https://theaviationist.com/2026/02/21/ukrainian-f-16-shooting-russian-target-apkws-ii/",
        "critical": false
    },
    {
        "country": "Russia",
        "city": "Moscow",
        "lat": 55.7558,
        "lon": 37.6173,
        "date": "2026-02-21 15:34:31",
        "type": "Clashes",
        "title": "Russian MOD Shows U.S. F-35, F-16 Intercepting Tu-95MS And Su-35S Off Alaska",
        "description": "The intercept was carried out as the Russian Tu-95MS bombers and their escorting fighters transited the Alaskan ADIZ (Air Defense Identification Zone). On Feb. 19, 2026, the U.S. Air Force launched two F-16s, two F-35s, one E-3, and four KC-135s tankers to intercept, positively identify, and escort the aircraft until they departed the Alaskan ADIZ. []",
        "fatalities": "0",
        "link": "https://theaviationist.com/2026/02/20/f-35-f-16-as-seen-from-tu-95/",
        "critical": false
    },
    {
        "country": "Iran",
        "city": "Tehran",
        "lat": 35.6892,
        "lon": 51.389,
        "date": "2026-02-21 15:34:31",
        "type": "Breaking News",
        "title": "Middle East Buildup Continues as Six F-22 Raptors Stopover at RAF Lakenheath",
        "description": "The deployment of F-22s towards the Middle East has been considered by many to be one of the final pieces of the puzzle regarding U.S. preparations for potential offensive action against Iran. The Langley Air Force Base (AFB) jets landed at the UK base shortly before 1830 UTC, with their arrival well documented by local []",
        "fatalities": "0",
        "link": "https://theaviationist.com/2026/02/17/six-f22-raptors-arrive-raf-lakenheath/",
        "critical": false
    },
    {
        "country": "Ukraine",
        "city": "Kyiv",
        "lat": 50.4501,
        "lon": 30.5234,
        "date": "2026-02-21 15:34:31",
        "type": "Clashes",
        "title": "U.S. and Dutch Pilots Allegedly Flying Ukrainian F-16s in Combat, Sources Say",
        "description": "Newly emerged reports claim a mixed squadron with Ukrainian, U.S. and Dutch pilots is flying combat missions on Ukrainian F-16s. New reports which are quickly going viral claim that Ukraine has stood up a new mixed squadron with Ukrainian, U.S. and Dutch pilots flying combat missions together un the country’s F-16s. The reports, which we []",
        "fatalities": "0",
        "link": "https://theaviationist.com/2026/02/17/us-and-dutch-pilots-allegedly-flying-ukrainian-f-16s/",
        "critical": false
    },
    {
        "country": "Israel",
        "city": "Gaza",
        "lat": 31.5047,
        "lon": 34.4648,
        "date": "2026-02-21 15:34:30",
        "type": "Airstrike",
        "title": "Israel strikes Hamas in Lebanon, Palestinian terrorists violate Gaza ceasefire 14 times from February 5 to 20, IDF says",
        "description": "As US President Donald Trump convened the Gaza Board of Peace for its inaugural meeting in Washington, DC, the IDF continued to report numerous ceasefire violations in the territory. Israel also struck the Ain al Hilweh Palestinian refugee camp near Sidon, Lebanon, stating that the target was used for the “preparation of terrorist activities against IDF forces in Lebanese territory.”\nThe post Israel strikes Hamas in Lebanon, Palestinian terrorist",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/israel-strikes-hamas-in-lebanon-palestinian-terrorists-violate-gaza-ceasefire-14-times-from-february-5-to-20-idf-says.php",
        "critical": false
    },
    {
        "country": "Israel",
        "city": "Gaza",
        "lat": 31.5047,
        "lon": 34.4648,
        "date": "2026-02-21 15:34:30",
        "type": "Clashes",
        "title": "Stabilization force and funding pledged for Gaza at Board of Peace meeting",
        "description": "At a February 19 meeting of the US-backed Board of Peace in Washington, DC, five countries pledged troops to an International Stabilization Force for Gaza, and representatives of 40 nations committed approximately $7 billion in funding. The initiative is part of the second phase of a ceasefire plan launched in October 2025. Clashes between the Israel Defense Forces and militants continue in Gaza, where Israeli forces report ongoing ceasefire viol",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/stabilization-force-and-funding-pledged-for-gaza-at-board-of-peace-meeting.php",
        "critical": false
    },
    {
        "country": "Israel",
        "city": "Tel Aviv",
        "lat": 32.0853,
        "lon": 34.7818,
        "date": "2026-02-21 15:34:30",
        "type": "Breaking News",
        "title": "Israeli operations in Lebanon against Hezbollah: February 9–15, 2026",
        "description": "Israel continued military operations in Lebanon between February 9 and February 15, 2026. Israeli activities last week were concentrated in south Lebanon and consisted largely of policing activity, maintaining the reduced intensity of previous weeks.\nThe post Israeli operations in Lebanon against Hezbollah: February 9–15, 2026 appeared first on FDDs Long War Journal.",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/israeli-operations-in-lebanon-against-hezbollah-february-9-15-2026.php",
        "critical": false
    },
    {
        "country": "Syria",
        "city": "Damascus",
        "lat": 33.5138,
        "lon": 36.2765,
        "date": "2026-02-21 15:34:30",
        "type": "Airstrike",
        "title": "Syrian government and SDF continue transition, US strikes Islamic State and withdraws from Tanf",
        "description": "The Syrian government and the Syrian Democratic Forces (SDF) have continued implementing a January transition agreement. US Central Command has maintained pressure on the Islamic State with airstrikes and withdrew from the Tanf garrison in southern Syria. Damascus is assuming control of Islamic State detention sites in the eastern part of the country. Senior US, Syrian, and SDF officials met in Munich to discuss integration, the ceasefire impleme",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/syrian-government-and-sdf-continue-transition-us-strikes-islamic-state-and-withdraws-from-tanf.php",
        "critical": false
    },
    {
        "country": "Israel",
        "city": "Gaza",
        "lat": 31.5047,
        "lon": 34.4648,
        "date": "2026-02-21 15:34:30",
        "type": "Breaking News",
        "title": "Hamas renews threats against rival Palestinian militias in Gaza",
        "description": "Hamas warned opposing militias that their days were numbered and that the Israeli military could not protect them. The threat came after some militias have carried out successful operations against Hamas in recent weeks and months. \nThe post Hamas renews threats against rival Palestinian militias in Gaza appeared first on FDDs Long War Journal.",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/hamas-renews-threats-against-rival-palestinian-militias-in-gaza.php",
        "critical": false
    },
    {
        "country": "Lebanon",
        "city": "Beirut",
        "lat": 33.8938,
        "lon": 35.5018,
        "date": "2026-02-21 15:34:30",
        "type": "Breaking News",
        "title": "Analysis: US Treasury sanctions Hezbollah front designed to insulate terror group’s gold reserves",
        "description": "Earlier this week, the US Treasury Department sanctioned Jood SARL, a gold exchange recently established in Lebanon, declaring it a front for the US-sanctioned Hezbollah financial institution Al Qard al Hassan (AQAH). For years, AQAH has acted as Hezbollah’s shadow bank, using its legal status as a charitable institution to elude banking regulations, oversight, and compliance. However, based on corporate records, it appears that Treasury did not ",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/analysis-us-treasury-sanctions-hezbollah-front-designed-to-insulate-terror-groups-gold-reserves.php",
        "critical": false
    },
    {
        "country": "Israel",
        "city": "Tel Aviv",
        "lat": 32.0853,
        "lon": 34.7818,
        "date": "2026-02-21 15:34:30",
        "type": "Breaking News",
        "title": "Israeli operations in Lebanon against Hezbollah: February 2–8, 2026",
        "description": "Israel continued military operations in Lebanon between February 2 and February 8, 2026. Israeli activities last week were concentrated in south Lebanon and significantly less intense and numerous than in preceding weeks.\nThe post Israeli operations in Lebanon against Hezbollah: February 2–8, 2026 appeared first on FDDs Long War Journal.",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/israeli-operations-in-lebanon-against-hezbollah-february-2-8-2026.php",
        "critical": false
    },
    {
        "country": "Syria",
        "city": "Damascus",
        "lat": 33.5138,
        "lon": 36.2765,
        "date": "2026-02-21 15:34:30",
        "type": "Breaking News",
        "title": "5,000 Islamic State detainees transferred to Iraq from Syria, will face investigations",
        "description": "Around 5,000 Islamic State detainees have been transferred from Syria to Iraq under a US-facilitated mission that began in late January, following security shifts in eastern Syria. The number of detainees transferred is expected to reach up to 7,000. Iraqi officials say the transfers may conclude by February 12 and that the detainees will face investigation and prosecution. Iraq has stressed it will not become a permanent repository for foreign f",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/5000-islamic-state-detainees-transferred-to-iraq-from-syria-will-face-investigations.php",
        "critical": false
    },
    {
        "country": "Iran",
        "city": "Tehran",
        "lat": 35.6892,
        "lon": 51.389,
        "date": "2026-02-21 15:34:30",
        "type": "Airstrike",
        "title": "Turkish foreign minister warns of nuclear arms race if Iran gets the bomb",
        "description": "Turkish Foreign Minister Hakan Fidan warned on February 9 that Ankara may pursue nuclear weapons if Iran acquires them, signaling a potential shift from rhetorical grievance to a conditional proliferation policy. While downplaying evidence of Iran’s weaponization and opposing US military strikes, Turkish officials continue to legitimize Tehran’s nuclear activities while framing Turkish nuclearization as a defensive necessity tied to regional “bal",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/turkish-foreign-minister-warns-of-nuclear-arms-race-if-iran-gets-the-bomb.php",
        "critical": false
    },
    {
        "country": "Iran",
        "city": "Tehran",
        "lat": 35.6892,
        "lon": 51.389,
        "date": "2026-02-21 15:34:30",
        "type": "Breaking News",
        "title": "Generation Jihad | The West’s greatest threat is still Al Qaeda",
        "description": "In its latest report on the state of global jihad, the UN reveals that Al Qaeda is expanding but doesn't mention one critical fact: the jihadist group's leader is based in Iran. Bill Roggio is joined by his FDD colleague Edmund Fitton-Brown—who previously oversaw the UN’s sanctions and monitoring team that produces these assessments—to unpack what the report gets right, what it misses, and why Al Qaeda—not the Islamic State—remains the most dange",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/generation-jihad-the-wests-greatest-threat-is-still-al-qaeda.php",
        "critical": false
    },
    {
        "country": "Syria",
        "city": "Damascus",
        "lat": 33.5138,
        "lon": 36.2765,
        "date": "2026-02-21 15:34:30",
        "type": "Breaking News",
        "title": "Syria joins anti-Islamic State coalition meeting as territory transition with SDF continues",
        "description": "Syria’s foreign minister joined a US-led anti-Islamic State coalition meeting in Riyadh on February 9, signaling deeper coordination after Damascus joined the coalition in November. The meeting followed a January 29 agreement between the Syrian government and the Syrian Democratic Forces enabling government deployments into northeastern Syria. Coalition members praised the deal and discussed transfers of Islamic State detainees to Iraq. As Syrian",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/syria-joins-anti-islamic-state-coalition-meeting-as-territory-transition-with-sdf-continues.php",
        "critical": false
    },
    {
        "country": "Iran",
        "city": "Tehran",
        "lat": 35.6892,
        "lon": 51.389,
        "date": "2026-02-21 15:34:30",
        "type": "Breaking News",
        "title": "Analysis: Naim Qassem delivers defiant speech to mark anniversary of Mahdi Schools",
        "description": "Naim Qassem marked the 33rd anniversary of the Mahdi Schools System with a defiant speech that said Iran was divinely promised a momentous victory over the United States and Israel. He also stressed that Hezbollah would not disarm, and its patient path of choosing even death over surrender would guarantee Lebanon's eventual victory over Israel.\nThe post Analysis: Naim Qassem delivers defiant speech to mark anniversary of Mahdi Schools appeared fi",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/analysis-naim-qassem-delivers-defiant-speech-to-mark-anniversary-of-mahdi-schools.php",
        "critical": false
    },
    {
        "country": "Syria",
        "city": "Damascus",
        "lat": 33.5138,
        "lon": 36.2765,
        "date": "2026-02-21 15:34:30",
        "type": "Airstrike",
        "title": "After Damascus-SDF deal, Syrian security forces deploy in northeastern Syria",
        "description": "Syrian government forces deployed into Al Hasakah and Qamishli in eastern Syria in early February under a January 30 agreement with the Syrian Democratic Forces (SDF). The deal is aimed at ending clashes and restoring central authority in mainly Kurdish areas that the SDF still controls. The government deployment coincided with reports of continued US transfers of Islamic State detainees from Syria to Iraq and US strikes on Islamic State targets.",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/after-damascus-sdf-deal-syrian-security-forces-deploy-in-northeastern-syria.php",
        "critical": false
    },
    {
        "country": "Iran",
        "city": "Tehran",
        "lat": 35.6892,
        "lon": 51.389,
        "date": "2026-02-21 15:34:30",
        "type": "Naval",
        "title": "Iranian regime escalates hostilities with US, hardens negotiating position",
        "description": "Iran has ramped up military provocations against US forces as nuclear negotiations loom, with regime officials sending mixed signals on uranium enrichment while refusing to discuss missile programs or terror proxies. Internal regime sources reveal the leadership's growing fear that a US strike could trigger mass uprisings. Despite killing over 36,000 protesters, according to some estimates, scattered demonstrations continue across Iran, with one ",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/iranian-regime-escalates-hostilities-with-us-hardens-negotiating-position.php",
        "critical": false
    },
    {
        "country": "Israel",
        "city": "Gaza",
        "lat": 31.5047,
        "lon": 34.4648,
        "date": "2026-02-21 15:34:30",
        "type": "Airstrike",
        "title": "Hamas injures IDF soldier, Palestinian terrorists violate Gaza ceasefire 10 times between January 22 and February 4",
        "description": "The US-brokered truce in Gaza is still holding but faces challenges as Hamas and other Palestinian terrorists continue to violate the terms almost daily, and the IDF responds with airstrikes. Despite the Rafah Crossing opening to pedestrian traffic, challenges are emerging surrounding procuring reconstruction funding, part of US President Donald Trump’s 20-point plan for Gaza.\nThe post Hamas injures IDF soldier, Palestinian terrorists violate Gaz",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/hamas-injures-idf-soldier-palestinian-terrorists-violate-gaza-ceasefire-10-times-between-january-22-and-february-4.php",
        "critical": false
    },
    {
        "country": "Syria",
        "city": "Damascus",
        "lat": 33.5138,
        "lon": 36.2765,
        "date": "2026-02-21 15:34:30",
        "type": "Breaking News",
        "title": "Generation Jihad | Big Yikes in Syria, Part XXXVII",
        "description": "In Part 37 of Big Yikes in Syria, Bill Roggio and Ahmad Sharawi unpack yet another round of bad alliances and strategic failure in the war-torn country.\nThe post Generation Jihad | Big Yikes in Syria, Part XXXVII appeared first on FDDs Long War Journal.",
        "fatalities": "0",
        "link": "https://www.longwarjournal.org/archives/2026/02/generation-jihad-big-yikes-in-syria-part-xxxvii.php",
        "critical": false
    }
]